app/controllers/Api/application_controller.rb

SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."access_token" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def restrict_access
    api_key = ApiKey.find_by_access_token(params[:access_token])