app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def index
    @c_post = Post.find(params[:post_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 6], ["text", "testing first comment "], ["created_at", "2022-12-02 23:39:51.754803"], ["updated_at", "2022-12-02 23:39:51.754803"]]
---
  def create
    @current_post = Post.find(params[:post_id])
    @comment = Comment.new(comment_params)
    @comment.post = @current_post
    @comment.user = current_user
    if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def destroy
    Comment.destroy(params[:id])