app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @like = Like.new(post: @post, user: current_user)
    if @like.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["post_id", 5], ["created_at", "2022-12-06 11:23:53.453577"], ["updated_at", "2022-12-06 11:23:53.453577"]]