app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE (id = 3) LIMIT $1  [["LIMIT", 11]]
---
  def show
    @user = User.includes(:posts).where("id = #{params[:user_id]}").first